{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Populate Messages drawer with seeded dummy conversations for all roles",
  "requirements": [
    {
      "id": "REQ-1",
      "summary": "Normalize session role values to match chat seeding logic and ensure each authenticated role gets at least one seeded thread with at least one message (and unread counts when applicable).",
      "acceptanceCriteria": [
        "When logged in as role 'User', opening the Messages drawer shows a non-empty thread list with at least 1 conversation and at least 1 message.",
        "When logged in as role 'NGO', opening the Messages drawer shows a non-empty thread list with at least 1 conversation and at least 1 message.",
        "When logged in as role 'DeliveryPartner', opening the Messages drawer shows a non-empty thread list with at least 1 conversation and at least 1 message.",
        "When logged in as role 'Admin', opening the Messages drawer shows a non-empty thread list with at least 1 conversation and at least 1 message.",
        "The unread badge count on the message icon is > 0 when the seeded threads include unread messages, and the icon itself always renders."
      ],
      "file_operations": [
        {
          "path": "frontend/src/state/ChatContext.tsx",
          "operation": "modify",
          "description": "Update role-to-seeding mapping by normalizing SessionContext role strings (e.g., 'User'/'NGO'/'DeliveryPartner'/'Admin') to the keys expected by generateSeededThreads (e.g., 'user'/'ngo'/'delivery'/'admin'). Ensure the resulting seeded threads for each role include at least one thread and at least one message, with at least one unread count > 0 where defined."
        }
      ]
    },
    {
      "id": "REQ-2",
      "summary": "Add a safe UI fallback so the Messages drawer shows a dummy welcome conversation preview whenever the thread list is empty, without breaking the ability to send a message after selecting it.",
      "acceptanceCriteria": [
        "If the chat thread list is empty, the Messages drawer shows a visible placeholder conversation preview instead of only showing an empty/blank area.",
        "The placeholder uses English user-facing text and does not break sending a message once a thread is selected/created."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/chat/ChatLauncher.tsx",
          "operation": "modify",
          "description": "Replace the empty-state rendering in the thread list with a placeholder conversation preview (participant name, last message, timestamp) that can be selected like a normal thread (instead of showing only 'No conversations yet')."
        },
        {
          "path": "frontend/src/state/ChatContext.tsx",
          "operation": "modify",
          "description": "Harden sendMessage (and related helpers as needed) so that if a user selects the placeholder preview while threads are empty, sending a message will safely create/initialize a local in-memory thread and then append the message, keeping the UI functional even when starting from an empty thread list."
        }
      ]
    }
  ]
}